zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_keystorectl.h
/**
 *  @brief Writes a key into the KEYSTORE
 *  将密钥写入密钥库
 *
 *  The sequence this function will follow:
 *  执行序列：
 *
 *  1. Confirm valid status on the KEYSTORECTL / 确认控制器状态有效
 *  2. Configure the key write by writing size and slot to the key that is to be
 *          written. Passed in via @ref DL_KEYSTORECTL_KeyWrConfig
 *     配置写入参数（密钥大小和目标槽）
 *  3. Confirm a valid write configuration / 确认写入配置有效
 *  4. Write key to the input buffer / 将密钥写入输入缓冲区
 *  5. Loop until status is back to valid / 等待状态恢复为有效
 *  6. Confirm key slots are successfully written / 确认密钥槽写入成功
 *
 *  @param[in] keystorectl  Pointer to the register overlay for the peripheral
 *                          外设寄存器基址指针
 *
 *  @param[in] keyWrConfig  Pointer to the write key configuration struct
 *                          @ref DL_KEYSTORECTL_KeyWrConfig
 *                          密钥写入配置结构体指针
 *
 *  @return    Status of the operation of type @ref DL_KEYSTORECTL_STATUS. Type
 *             will be DL_KEYSTORECTL_STATUS_VALID if successful, or return the
 *             error status.
 *             操作状态，成功返回 DL_KEYSTORECTL_STATUS_VALID
 *
 *  @note The function @ref DL_KEYSTORECTL_setNumberOf256Keys must be run
 *        before this can be executed.
 *  @note It is not possible to overwrite a previously configured key. A full
 *        BOOTRST must be executed before the KEYSTORECTL is erased and can be
 *        re-initialized and written.
 *  @note this function can only be written in a secure operating state before
 *        the INITDONE signal is asserted.
 *  @note 调用前必须先执行 setNumberOf256Keys；无法覆盖已有密钥，
 *        需执行完整 BOOTRST 后才可重新初始化和写入。
 *        仅可在 INITDONE 信号置位前的安全运行状态下写入。
 */
DL_KEYSTORECTL_STATUS DL_KEYSTORECTL_writeKey(
    KEYSTORECTL_Regs *keystorectl, DL_KEYSTORECTL_KeyWrConfig *keyWrConfig);

/**
 *  @brief Transfers key loaded in KEYSTORE into intended crypto
 *  将密钥库中的密钥传输到目标加密引擎
 *
 *  Combination of previous functions in order to give the entire operation.
 *  Expected runtime sequence:
 *  执行序列：
 *
 *  1. Confirm valid status on the KEYSTORECTL / 确认控制器状态有效
 *  2. Configure the read transfer by writing size, slot, and recipient
 *        This is passed in via the struct @ref DL_KEYSTORECTL_Config
 *     配置传输参数（密钥大小、源槽和目标加密引擎）
 *  3. Confirm a valid status and transfer configuration of the KEYSTORECTL
 *     确认状态和传输配置有效
 *  4. Loop until status is back to valid / 等待状态恢复为有效
 *
 *  @param[in] keystorectl  Pointer to the register overlay for the peripheral
 *                          外设寄存器基址指针
 *  @param[in] config       Pointer to a filled out config struct of type
 *                          @ref DL_KEYSTORECTL_Config
 *                          密钥传输配置结构体指针
 *
 *  @return    Status of the operation of type @ref DL_KEYSTORECTL_STATUS. Type
 *             will be DL_KEYSTORECTL_STATUS_VALID if successful, or return the
 *             error status.
 *             操作状态，成功返回 DL_KEYSTORECTL_STATUS_VALID
 */
DL_KEYSTORECTL_STATUS DL_KEYSTORECTL_transferKey(
    KEYSTORECTL_Regs *keystorectl, const DL_KEYSTORECTL_Config *config);

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_KEYSTORE_CTL__ */

#endif /* ti_dl_dl_KEYSTORECTL__include */
/** @}*/
